client/src/main/request.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://ilyachuvaev.com/soapservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:contactRequest>
            <gs:Contact>
                <gs:id>1L</gs:id>
            </gs:Contact>
        </gs:contactRequest>
    </soapenv:Body>
</soapenv:Envelope>